[
  {
    "key_val": 1,
    "MBTI Personality": "ISTJ",
    "Personality": "Logistician",
    "Category": "Sentinels",
    "Description": "A Logistician (ISTJ) is someone with Introverted, Observant, Thinking, and Judging personality traits. These people tend to be reserved yet willful, with a rational outlook on life. They compose their actions carefully and carry them out with a methodical purpose. Logisticians often earn respect for their reliability, their practicality, and their ability to stay grounded and logical, even in the most stressful situations. Logisticians have a deep respect for structure and tradition and are often drawn to organizations, workplaces, and educational settings that offer clear hierarchies and expectations. People with the Logistician personality type rarely hesitate to take responsibility for their actions and choices. To Logisticians, honesty is far more important than showmanship.",
    "Known Personalities (Male)": "Amitabh Bachhan (Actor)",
    "Known Personalities (Female)": "Indira Gandhi (Politician)"
  },
  {
    "key_val": 2,
    "MBTI Personality": "ISFJ",
    "Personality": "Defender",
    "Category": "Sentinels",
    "Description": "A Defender (ISFJ) is someone with Introverted, Observant, Feeling, and Judging personality traits. These people tend to be warm and unassuming in their own steady way. They’re efficient and responsible, giving careful attention to practical details in their daily lives. People with this personality type are hardworking and devoted and feel a deep sense of responsibility to those around them. Though sensitive and caring, Defenders also have excellent analytical abilities and an eye for detail. Among Defenders’ most distinctive traits is loyalty. Defenders have a special talent for making their friends and acquaintances feel seen, known, and cherished. Dedicated and thoughtful, Defenders find great joy in helping those around them build stable, secure, and happy lives.",
    "Known Personalities (Male)": "Dr. Manmohan Singh (Former Prime Minister Of India)",
    "Known Personalities (Female)": "Sudha Murthy (Philanthropist And Author)"
  },
  {
    "key_val": 3,
    "MBTI Personality": "INFJ",
    "Personality": "Advocate",
    "Category": "Diplomats",
    "Description": "An Advocate (INFJ) is someone with Introverted, Intuitive, Feeling, and Judging personality traits. They tend to approach life with deep thoughtfulness and imagination. Their inner vision, personal values, and a quiet, principled version of humanism guide them in all things. Advocates (INFJs) may be the rarest personality type of all, but they certainly leave their mark on the world. For Advocate personalities, success doesn’t come from money or status but from seeking fulfillment, helping others, and being a force for good in the world. Advocates are committed to making the world a better place and are troubled by injustice. Thoughtful and compassionate, Advocates pour a great deal of energy and care into their relationships. Advocates are hardwired to right the wrongs of the world, no matter how big or small. These personalities just need to remember that while they’re busy taking care of everyone else, they need to pause sometimes and take care of themselves as well.",
    "Known Personalities (Male)": "Rabindranath Tagore (Poet And Philosopher)",
    "Known Personalities (Female)": "Kiran Bedi (Former IPS Officer)"
  },
  {
    "key_val": 4,
    "MBTI Personality": "INTJ",
    "Personality": "Architect",
    "Category": "Analyst",
    "Description": "An Architect (INTJ) is a person with the Introverted, Intuitive, Thinking, and Judging personality traits. These thoughtful tacticians love perfecting the details of life, applying creativity and rationality to everything they do. It is one of the rarest personality types and also one of the most capable too. They tend to nonstop analyze everything around them. Architects question everything and want to be successful and not just inventive. They believe that, through willpower and intelligence, they can achieve even the most challenging goals. They are imaginative yet decisive, ambitious yet private, and curious yet focused. From the outside, these contradictions may seem baffling, but they make perfect sense once you understand the inner workings of the Architect mind.",
    "Known Personalities (Male)": "Satya Nadella (CEO of Microsoft)",
    "Known Personalities (Female)": "Nirmala Sitharaman (Former Minister Of Finance And Corporate Affairs)"
  },
  {
    "key_val": 5,
    "MBTI Personality": "ISTP",
    "Personality": "Virtuoso",
    "Category": "Explorers",
    "Description": "A Virtuoso (ISTP) is someone with the Introverted, Observant, Thinking, and Prospecting personality traits. They tend to have an individualistic mindset, pursuing goals without needing much external connection. They engage in life with inquisitiveness and personal skill, varying their approach as needed. Virtuosos love to explore with their hands and their eyes, touching and examining the world around them with cool rationalism and spirited curiosity. Often mechanics and engineers, Virtuosos find no greater joy than in getting their hands dirty pulling things apart and putting them back together, just a little bit better than they were before. Friendly but very private, calm but suddenly spontaneous, extremely curious but unable to stay focused on formal studies, Virtuoso personalities can be a challenge to predict, even by their friends and loved ones.",
    "Known Personalities (Male)": "Mahendra Singh Dhoni (Cricketer And Former Captain Of The Indian Cricket Team)",
    "Known Personalities (Female)": "Sania Mirza (Tennis Player)"
  },
  {
    "key_val": 6,
    "MBTI Personality": "ISFP",
    "Personality": "Adventurer",
    "Category": "Explorers",
    "Description": "An Adventurer (ISFP) is a person with Introverted, Observant, Feeling, and Prospecting personality traits. They tend to have open minds, approach life, and new experiences, and people with grounded warmth. Their ability to stay in the moment helps them uncover exciting potential. Adventurers are true artists – although not necessarily in the conventional sense. For this personality type, life itself is a canvas for self-expression. Driven by curiosity and eager to try new things, people with this personality often have a fascinating array of passions and interests. Adventurers embrace a flexible, adaptable approach to life. Adventurers are warm, friendly, and caring, taking wholehearted enjoyment in the company of their nearest and dearest.",
    "Known Personalities (Male)": "Dr. APJ Abdul Kalam (Former President Of India)",
    "Known Personalities (Female)": "Aishwarya Rai Bachchan (Actress)"
  },
  {
    "key_val": 7,
    "MBTI Personality": "INFP",
    "Personality": "Mediator",
    "Category": "Diplomats",
    "Description": "A Mediator (INFP) is someone who possesses Introverted, Intuitive, Feeling, and Prospecting personality traits. These rare personality types tend to be quiet, open-minded, and imaginative, and they apply a caring and creative approach to everything they do. Mediators (INFPs) have vibrant, passionate inner lives. Creative and imaginative, they happily lose themselves in daydreams, inventing all sorts of stories and conversations in their minds. Idealistic and empathetic, Mediators long for deep, soulful relationships and feel called to help others. Mediators are compassionate and nonjudgmental, always willing to hear another person’s story. Mediators are poets, writers, actors, and artists.",
    "Known Personalities (Male)": "Aamir Khan (Actor And Filmmaker)",
    "Known Personalities (Female)": "Tabu (Actress)"
  },
  {
    "key_val": 8,
    "MBTI Personality": "INTP",
    "Personality": "Logician",
    "Category": "Analyst",
    "Description": "A Logician (INTP) is someone with Introverted, Intuitive, Thinking, and Prospecting personality traits. These flexible thinkers enjoy taking an unconventional approach to many aspects of life. Logicians pride themselves on their unique perspectives and vigorous intellect. They can’t help but puzzle over the mysteries of the universe – which may explain why some of the most influential philosophers and scientists of all time have been Logicians. This personality type is fairly rare, but with their creativity and inventiveness, Logicians aren’t afraid to stand out from the crowd. They have a reputation for being pensive, detached, and a bit reserved. Logicians love to analyze patterns. People with this personality type can overthink even the smallest of decisions. This makes them feel ineffective and stuck, so exhausted by the endless parade of thoughts in their mind that they struggle to get things done.",
    "Known Personalities (Male)": "Mukesh Ambani (Businessman)",
    "Known Personalities (Female)": "Kalpana Chawla (Astronaut And Space Shuttle Mission Specialist)"
  },
  {
    "key_val": 9,
    "MBTI Personality": "ESTP",
    "Personality": "Entrepreneur",
    "Category": "Explorers",
    "Description": "An Entrepreneur (ESTP) is someone with Extraverted, Observant, Thinking, and Prospecting personality traits. They tend to be energetic and action-oriented, deftly navigating whatever is in front of them. They love uncovering life’s opportunities, whether socializing with others or in more personal pursuits. Laughing and entertaining with blunt and earthy humor, Entrepreneur personalities love to be the center of attention. Entrepreneurs are the likeliest personality type to make a lifestyle of risky behavior. They live in the moment and dive into the action. Entrepreneurs have unique skills in noticing small changes.",
    "Known Personalities (Male)": "Virat Kohli (Cricketer)",
    "Known Personalities (Female)": "Priyanka Chopra Jonas (Actress And Entrepreneur)"
  },
  {
    "key_val": 10,
    "MBTI Personality": "ESFP",
    "Personality": "Entertainer",
    "Category": "Explorers",
    "Description": "An Entertainer (ESFP) is a person with Extraverted, Observant, Feeling, and Prospecting personality traits. These people love vibrant experiences, engaging in life eagerly and taking pleasure in discovering the unknown. They can be very social, often encouraging others into shared activities. If anyone is to be found spontaneously breaking into song and dance, it is the Entertainer personality type. Utterly social, Entertainers enjoy the simplest things, and there’s no greater joy for them than just having fun with a good group of friends. Entertainers have the strongest aesthetic sense of any personality type. Entertainers are naturally curious, exploring new designs and styles with ease.",
    "Known Personalities (Male)": "Shah Rukh Khan (Actor)",
    "Known Personalities (Female)": "Deepika Padukone (Actress)"
  },
  {
    "key_val": 11,
    "MBTI Personality": "ENFP",
    "Personality": "Campaigner",
    "Category": "Diplomats",
    "Description": "A Campaigner (ENFP) is someone with Extraverted, Intuitive, Feeling, and Prospecting personality traits. These people tend to embrace big ideas and actions that reflect their sense of hope and goodwill toward others. Their vibrant energy can flow in many directions. Campaigners (ENFPs) are truly free spirits – outgoing, openhearted, and open-minded. With their lively, upbeat approach to life, they stand out in any crowd. Campaigners are devoted to enriching their relationships and their social lives. They can also be introspective. Campaigners will spend a lot of time exploring different relationships, feelings, and ideas before they find a path for their lives that feels right.",
    "Known Personalities (Male)": "Ratan Tata (Businessman)",
    "Known Personalities (Female)": "Dia Mirza (Actress And Environmentalist)"
  },
  {
    "key_val": 12,
    "MBTI Personality": "ENTP",
    "Personality": "Debater",
    "Category": "Analyst",
    "Description": "A Debater (ENTP) is a person with Extraverted, Intuitive, Thinking, and Prospecting personality traits. They tend to be bold and creative, deconstructing and rebuilding ideas with great mental agility. Debaters aren’t afraid to disagree with the status quo. People with this personality type are knowledgeable and curious, with a playful sense of humor, and they can be incredibly entertaining. They simply have an offbeat, contrarian idea of fun – one that involves a healthy dose of spirited debate. While Debater personalities love to brainstorm and think big, they tend to avoid getting caught doing the “grunt work” of implementing their ideas. The good news is that people with this personality type will never lose their sharply nonconformist edge. They can simply use their cognitive flexibility to understand and explore other people’s perspectives, recognizing the value of consideration and compromise alongside logic and progress.",
    "Known Personalities (Male)": "Anurag Kashyap (Filmmaker)",
    "Known Personalities (Female)": "Kiran Mazumdar-Shaw (Entrepreneur And Business Woman)"
  },
  {
    "key_val": 13,
    "MBTI Personality": "ESTJ",
    "Personality": "Executive",
    "Category": "Sentinels",
    "Description": "An Executive (ESTJ) is someone with Extraverted, Observant, Thinking, and Judging personality traits. They possess great fortitude, emphatically following their own sensible judgment. They often serve as a stabilizing force among others, able to offer solid direction amid adversity. Executives are representatives of tradition and order, utilizing their understanding of what is right, wrong, and socially acceptable to bring families and communities together. Embracing the values of honesty, dedication, and dignity, people with the Executive personality type are valued for their clear advice and guidance, and they happily lead the way on difficult paths. Executives are arbitrarily stubborn, but because they truly believe that these values are what make society work. Executives really do have all the facts and are able to lead the charge in directions that work for everyone.",
    "Known Personalities (Male)": "Narayana Murthy (Businessman)",
    "Known Personalities (Female)": "Chanda Kochhar (Former Banker)"
  },
  {
    "key_val": 14,
    "MBTI Personality": "ESFJ",
    "Personality": "Consul",
    "Category": "Sentinels",
    "Description": "A Consul (ESFJ) is a person with Extraverted, Observant, Feeling, and Judging personality traits. They are attentive and people-focused, and they enjoy taking part in their social community. Their achievements are guided by decisive values, and they willingly offer guidance to others. Consuls do believe in the power of hospitality and good manners, and they tend to feel a sense of duty to those around them. Consuls may find it difficult not to judge when someone takes a path that strikes them as misguided. Loyal to the core, they build lasting relationships, and they can be counted on to show up whenever a helping hand – or a listening ear – is needed.",
    "Known Personalities (Male)": "Anupam Kher (Actor)",
    "Known Personalities (Female)": "Ekta Kapoor (Producer)"
  },
  {
    "key_val": 15,
    "MBTI Personality": "ENFJ",
    "Personality": "Protagonist",
    "Category": "Diplomats",
    "Description": "A Protagonist (ENFJ) is a person with Extraverted, Intuitive, Feeling, and Judging personality traits. These warm, forthright types love helping others, and they tend to have strong ideas and values. They back their perspective with the creative energy to achieve their goals. Thoughtful and idealistic, these personality types strive to have a positive impact on other people and the world around them. Protagonists are born leaders, which explains why these personalities can be found among many notable politicians, coaches, and teachers. Their passion and charisma allow them to inspire others not just in their careers but in every arena of their lives, including their relationships. Protagonists tend to be vocal about their values, including authenticity and altruism. The protagonists’ secret weapon is their purity of intent. Protagonists reveal how seemingly ordinary situations can be handled with compassion, dedication, and care.",
    "Known Personalities (Male)": "Mahatma Gandhi (Political And Spiritual Leader)",
    "Known Personalities (Female)": "Mother Teresa (Nun And Humanitarian)"
  },
  {
    "key_val": 16,
    "MBTI Personality": "ENTJ",
    "Personality": "Commander",
    "Category": "Analyst",
    "Description": "A Commander (ENTJ) is someone with Extraverted, Intuitive, Thinking, and Judging personality traits. Commanders are natural-born leaders. People with this personality type embody the gifts of charisma and confidence and project authority in a way that draws crowds together toward a common goal. Commanders love a good challenge and they firmly believe that given enough time and resources, they can achieve any goal. This quality makes people with the Commander personality type brilliant entrepreneurs, and their ability to think strategically and hold a long-term focus while executing each step of their plans with determination and precision makes them powerful business leaders. Commanders are dominant, relentless, and unforgiving. Commanders are true powerhouses, and they cultivate an image of being larger than life.",
    "Known Personalities (Male)": "Anand Mahindra (Businessman)",
    "Known Personalities (Female)": "Nita Ambani (Philanthropist And Businesswoman)"
  }
]